In [1]:
d2 = {'key1':[6,7,8,9,10,"sudh"],
      'key2':[16,17,18,19,20,"prav"],
      'key3':[26,27,28,29,30,"gok"],
      'key4':[36,37,38,39,40,"dinesh"],
      }

In [2]:
d1 = {'key1':[1,2,3,4,5,"sudh1"],
      'key2':[1,2,3,4,5,"sudh2"],
      'key3':[1,2,3,4,5,"sudh3"],
      'key10':[36,37,38,39,40,"sudh4"]}

In [3]:
import pandas as pd

In [51]:
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

In [3]:
pd.merge(df1, df2)

NameError: name 'pd' is not defined

In [ ]:
pd.merge(df1, df2,how='inner',on='key4')

KeyError: 'key4'

In [7]:
import pandas as pd

In [15]:
k1 = {'key1':[20,30,"sudh1"],
      'key2':[20,30,"sudh2"],
      'key3':[30,40,"sudh3"] }

k2 = {'key1':[50,30,"sudh1"],
      'key2':[100,30,"sudh2"],
      'key3':[30,40,"sudh3"] }

df1 = pd.DataFrame(k1)
df2 = pd.DataFrame(k2)

In [16]:
df2

    key1   key2   key3
0     50    100     30
1     30     30     40
2  sudh1  sudh2  sudh3

In [13]:
df1

    key1   key2   key3
0     20     20     30
1     30     30     40
2  sudh1  sudh2  sudh3

In [21]:
pd.merge(df1, df2,how = 'left', on='key1')

    key1 key2_x key3_x key2_y key3_y
0     20     20     30    NaN    NaN
1     30     30     40     30     40
2  sudh1  sudh2  sudh3  sudh2  sudh3

In [4]:
d10 = {'key11':[1,2,3,4,5,"sudh"],
       'key22':[7,8,9,10,11,12],
       'key31':[13,14,15,16,17,18],
       'key41':[19,20,21,22,23,24]
       }

df10 = pd.DataFrame(d10, index = [1,2,3,4,5,6])

d20 = {'key1':[1,2,3,4,5,"sudh"],
       'key2':[7,8,"kumar",10,11,12],
       'key3':[13,14,15,16,17,18],
       'key4':[19,20,21,"ineuron","pwskills",24]
       }

df20 = pd.DataFrame(d20, index = [1,2,3,4,5,'sudh'])

In [51]:
# joins based on indexes
# merge based on column values

df10.join(df20)

  key11  key22  key31  key41 key1   key2  key3      key4
1     1      7     13     19    1      7  13.0        19
2     2      8     14     20    2      8  14.0        20
3     3      9     15     21    3  kumar  15.0        21
4     4     10     16     22    4     10  16.0   ineuron
5     5     11     17     23    5     11  17.0  pwskills
6  sudh     12     18     24  NaN    NaN   NaN       NaN

In [42]:
df10.join(df20,how= 'outer')

  key11  key22  key31  key41  key1   key2  key3      key4
1     1      7     13     19     1      7    13        19
2     2      8     14     20     2      8    14        20
3     3      9     15     21     3  kumar    15        21
4     4     10     16     22     4     10    16   ineuron
5     5     11     17     23     5     11    17  pwskills
6  sudh     12     18     24  sudh     12    18        24

In [50]:
# join matches based on the index
df10.join(df20,how= 'right')

     key11  key22  key31  key41  key1   key2  key3      key4
1        1    7.0   13.0   19.0     1      7    13        19
2        2    8.0   14.0   20.0     2      8    14        20
3        3    9.0   15.0   21.0     3  kumar    15        21
4        4   10.0   16.0   22.0     4     10    16   ineuron
5        5   11.0   17.0   23.0     5     11    17  pwskills
sudh   NaN    NaN    NaN    NaN  sudh     12    18        24

In [45]:
df10.join(df20,how= 'left')

  key11  key22  key31  key41  key1   key2  key3      key4
1     1      7     13     19     1      7    13        19
2     2      8     14     20     2      8    14        20
3     3      9     15     21     3  kumar    15        21
4     4     10     16     22     4     10    16   ineuron
5     5     11     17     23     5     11    17  pwskills
6  sudh     12     18     24  sudh     12    18        24

In [43]:
df10.join(df20,how= 'inner')

  key11  key22  key31  key41  key1   key2  key3      key4
1     1      7     13     19     1      7    13        19
2     2      8     14     20     2      8    14        20
3     3      9     15     21     3  kumar    15        21
4     4     10     16     22     4     10    16   ineuron
5     5     11     17     23     5     11    17  pwskills
6  sudh     12     18     24  sudh     12    18        24

In [5]:
import pandas as pd
pd.concat([df10,df20],axis=0)

     key11  key22  key31  key41  key1   key2  key3      key4
1        1    7.0   13.0   19.0   NaN    NaN   NaN       NaN
2        2    8.0   14.0   20.0   NaN    NaN   NaN       NaN
3        3    9.0   15.0   21.0   NaN    NaN   NaN       NaN
4        4   10.0   16.0   22.0   NaN    NaN   NaN       NaN
5        5   11.0   17.0   23.0   NaN    NaN   NaN       NaN
6     sudh   12.0   18.0   24.0   NaN    NaN   NaN       NaN
1      NaN    NaN    NaN    NaN     1      7  13.0        19
2      NaN    NaN    NaN    NaN     2      8  14.0        20
3      NaN    NaN    NaN    NaN     3  kumar  15.0        21
4      NaN    NaN    NaN    NaN     4     10  16.0   ineuron
5      NaN    NaN    NaN    NaN     5     11  17.0  pwskills
sudh   NaN    NaN    NaN    NaN  sudh     12  18.0        24

In [6]:

pd.concat([df10,df20],axis=1)

     key11  key22  key31  key41  key1   key2  key3      key4
1        1    7.0   13.0   19.0     1      7  13.0        19
2        2    8.0   14.0   20.0     2      8  14.0        20
3        3    9.0   15.0   21.0     3  kumar  15.0        21
4        4   10.0   16.0   22.0     4     10  16.0   ineuron
5        5   11.0   17.0   23.0     5     11  17.0  pwskills
6     sudh   12.0   18.0   24.0   NaN    NaN   NaN       NaN
sudh   NaN    NaN    NaN    NaN  sudh     12  18.0        24